import { Component, OnInit } from '@angular/core';

@Component({
  selector: 'app-news-detail',
  templateUrl: './news-detail.component.html',
  styleUrls: ['./news-detail.component.css']
})
export class NewsDetailComponent implements OnInit {


    test = "Фермер организовал целую операцию по выявлению того, кто убирает в сараеФермеру из Великобритании с уборкой в сарае помогает мышь.Фермер организовал целую операцию по выявлению того, кто убирает в сарае, после того как обнаружил, что разбросанные хозяйственные приспособления и инструменты сложены в ящик. Стивен МакКрис начал специально разбрасывать инструменты по сараю, чтобы убедиться, что на утро они все собраны в ящик. После нескольких недель таких разбирательств он решил установить камеру и обнаружил, что инструменты по ночам в ящик складывает мышь. После нескольких недель таких разбирательств он решил установить камеру и обнаружил, что инструменты по ночам в ящик складывает мышь. После нескольких недель таких разбирательств он решил установить камеру и обнаружил, что инструменты по ночам в ящик складывает мышь.";

  constructor() { }

  ngOnInit() {
  }

}
